Repository: AuthorProxy/QP
Catalog: Resources/TemplateStrings.*.resx
Languages: ru_ru

source: Additional namespases
ru_ru: Дополнительные пространства имен

source: Add New Object
ru_ru: Добавить новый объект

source: Add New Page
ru_ru: Добавить новую страницу

source: Add New Template
ru_ru: Добавить новый шаблон

source: Apply to existing objects
ru_ru: Применить к сушествующим объектам

source: Apply to existing pages and objects
ru_ru: Применить к сушествующим страницам и объектам

source: Assembled
ru_ru: Собрано

source: Assembled By
ru_ru: Собрал

source: Charset
ru_ru: Набор символов

source: Code Behind for Preview
ru_ru: Code Behind для предварительного просмотра

source: Custom class for Generics
ru_ru: Пользовательский класс для объектов типа Generic

source: Custom class for pages
ru_ru: Пользовательский класс для страниц

source: Custom class for Publishing Containers
ru_ru: Пользовательский класс для для объектов типа Publishing Container

source: Custom class for template
ru_ru: Пользовательский класс для шаблона

source: Disable auto data binding
ru_ru: Отключить автоматическое связывание с данными

source: Enable ViewState
ru_ru: Разрешить ViewState

source: File Name
ru_ru: Имя файла

source: Folder
ru_ru: Папка

source: Folder Name
ru_ru: Имя папки

source: Locale
ru_ru: Локализация

source: Max Number of Format Stored Versions
ru_ru: Максимальное число хранимых версий форматов

source: .NET Class Name
ru_ru: Имя .NET-класса

source: .NET Language
ru_ru: Язык .NET

source: Override object settings
ru_ru: Перезаписать настройки объектов

source: Override page settings
ru_ru: Перезаписать настройки страниц

source: Presentation
ru_ru: Представление

source: Presentation for Preview
ru_ru: Представление для предварительного просмотра

source: Send No-Cache header
ru_ru: Посылать заголовок No-Cache

source: Type
ru_ru: Тип

source: Custom class for Publishing Forms
ru_ru: Пользовательский класс для для объектов типа Publishing Form

# TemplateNotFound
source: Template #{0} not found
ru_ru: Шаблон №{0} не найден

# LockedByAnyoneElse
source: Template is locked by user {0}.
ru_ru: Шаблон заблокирован пользователем {0}

# PageNotFound
source: Page #{0} not found
ru_ru: Страница №{0} не найдена

source: Custom class
ru_ru: Пользовательский класс

source: Generate trace
ru_ru: Генерировать трассировку

source: Proxy caching
ru_ru: Кэширование на proxy

source: Send Last-Modified header
ru_ru: Посылать заголовок Last-Modified

# PageLockedByAnyoneElse
source: Page is locked by user {0}.
ru_ru: Страница заблокирована пользователем {0}

source: Allow Dynamic Content Changing
ru_ru: Разрешить динамическое изменение контента

source: Content
ru_ru: Контент

source: Default Format
ru_ru: Формат по умолчанию

source: Default Sorting
ru_ru: Сортировка по умолчанию

# Duration
source: Duration (min.)
ru_ru: Длительность (мин.)

source: Dynamic Content Variable
ru_ru: Переменная, содержащая название контента

source: Dynamic Sorting Expression
ru_ru: Выражение динамической сортировки

source: Enable Data Caching
ru_ru: Разрешить кэширование данных

source: Enable OnScreen
ru_ru: Разрешить OnScreen

source: End Level
ru_ru: Конечный уровень

source: Filter
ru_ru: Фильтр

source: First Article Number In The Selection
ru_ru: Номер первой статьи в выборке

# GenerateCode
source: Generate code for updating/appending articles
ru_ru: Генерировать код для создания/удаления статей

source: Global
ru_ru: Глобальный

source: Number of articles in the selection
ru_ru: Количество статей в выборке

source: Override template object
ru_ru: Переопределить объект шаблона

source: Parent template object
ru_ru: Родительский объект шаблона

source: Return Articles
ru_ru: Возвращать статьи

source: Return Last Modified Date
ru_ru: Возвращать дату последней модификации

source: Security Mode
ru_ru: Режим безопасности

source: Selection includes
ru_ru: Выборка включает

source: Selection is starting
ru_ru: Выборка начинается

source: Show archived
ru_ru: Показывать архивированные

source: Start Level
ru_ru: Начальный уровень

source: Statuses
ru_ru: Статусы

source: Submission response page
ru_ru: Перейти после заполнения формы на страницу

source: Use Default Values
ru_ru: Использовать значения по умолчанию

source: Use Dynamic Sorting
ru_ru: Использовать динамическую сортировку

source: Use Schedule
ru_ru: Использовать расписание

source: Select Object
ru_ru: Выберите объект

# ObjectLockedByAnyoneElse
source: Object is locked by user {0}.
ru_ru: Объект заблокирован пользователем {0}

source: Add New Format
ru_ru: Добавить новый формат

# FormatNotFound
source: Format #{0} Not Found
ru_ru: Формат №{0} не найден

# FormatLockedByAnyoneElse
source: Format is locked by user{0}
ru_ru: Формат заблокирован пользователем {0}

source: Default
ru_ru: По умолчанию

source: Add Namespace
ru_ru: Добавить пространство имен

# NetNameMaxLengthExceeded
source: .NET class name should not exceeded 255 characters
ru_ru: Длина имени .NET класса не должна превышать {0} символов

# NetNameInvalidFormat
source: .NET name has invalid format
ru_ru: Имя .NET класса имеет неверный формат

# FolderNameInvalidFormat
source: Folder name has invalid format
ru_ru: Имя папки имеет неверный формат

# FolderNameMaxLengthExceeded
source: Folder name length should not exceed {0} characters
ru_ru: Длина имени папки не должна превышать 255 символов

# PresentationRequired
source: Please enter presentation
ru_ru: Пожалуйста, укажите представление

# CustomClassForPagesMaxLengthExceeded
source: Custom Class For Pages length should not exceed 255 characters
ru_ru: Длина пользовательского класса для страниц не должна превушать {0} символов

# CustomClassForPagesInvalidFormat
source: Custom class for pages has invalid format
ru_ru: Пользовательский класс для страниц имеет неверный формат

# CustomClassForTemplatesMaxLengthExceeded
source: Custom class for templates length should not exceed 255 characters
ru_ru: Длина пользовательского класса для шаблона не должна превышать {0} символов

# CustomClassForTemplateInvalidFormat
source: Custom class for template has invalid format
ru_ru: Пользоваетльский класс для шаблона имеет неверный формат

# CustomClassForGenericsMaxLengthExceeded
source: Custom class for generics length should not exceed 255 characters
ru_ru: Длина пользовательского класса для объектов типа Generic не должна превышать {0} символов

# CustomClassForGenericsInvalidFormat
source: Custom class for generics has invalid format
ru_ru: Пользовательский класс для объектов типа Generic имеет неверный формат

# CustomClassForContainersInvalidFormat
source: Custom class for publishing containers has invalid format
ru_ru: Пользовательский класс для для объектов типа Publishing Container имеет неверный формат

# CustomClassForFormsInvalidFormat
source: Custom class for forms has invalid format
ru_ru: Пользовательский класс для для объектов типа Publishing Form имеет неверный формат

# CustomClassForFormsMaxLengthExceeded
source: Custom class for forms length should not exceed 255 characters
ru_ru: Длина пользовательского класса для для объектов типа Publishing Form не должна превышать {0} символов

# CustomClassForPublishingContainersMaxLengthExceeded
source: Custom class for publishing containers length should not exceed 255 characters
ru_ru: Длина пользовательского класса для для объектов типа Publishing Container не должна превышать {0} символов

# AdditionalNamespaceInvalidFormat
source: Additional Namespace #{0} has invalid format
ru_ru: Дополнительное пространство имен №{0} имеет неверный формат

# AdditionalNamespaceLengthExceeded
source: Additional Namespace #{0} length should not exceed 255 characters
ru_ru: Длина дополнительного пространства имен №{0} не должна превышать 255 символов

# AdditionalNamespaceRequired
source: Additional Namespace #{0} is required
ru_ru: Необходимо указать допольнительное пространство имен №{0}

# UsingTotalLengthExceeded
source: Additional Namespaces total length should not exceed 512 characters
ru_ru: Суммарная длина дополнительных пространств имен не должна превышать 512 символов

# ExpiresIn
source: Expires in (hrs.)
ru_ru: Истекает через (ч.)

# CustomClassInvalidFormat
source: Custom class has invalid format
ru_ru: Пользовательский класс имеет неверный формат

# CustomClassMaxLengthExceeded
source: Custom Class name`s length should not exceed 255 characters
ru_ru: Длина пользовательского класса не должна превышать {0} символов

# FileNameMaxLengthExceeded
source: File Name length should not exceed 255 characters
ru_ru: Длина имени файла не должан превышать 255 символов

# FileNameRequired
source: Please enter file name
ru_ru: Пожалуйста, укажите имя файла

# WarningString
source: Setting this option on may decrease page performance
ru_ru: Установка этой опции может ухудшить производительность страницы

source: Select Default Format
ru_ru: Выберите формат по-умолчанию

source: Use Security
ru_ru: Использовать безопасность

# ReturnAllArticles
source: Return all articles with their permission levels
ru_ru: Возвращать все статьи вместе с уровнями доступа

source: Return only matching articles
ru_ru: Возвращать только подходящие статьи

source: Randomly
ru_ru: Случайным образом

source: Sequentially
ru_ru: Последовательно

source: Field
ru_ru: Поле

source: Sort Order
ru_ru: Порядок сортировки

source: Add Sort Expression
ru_ru: Добавить выражение сортировки

source: All articles
ru_ru: Все статьи

source: From the first article
ru_ru: С первой статьи

# FromTheSpecifiedArticle
source: From the article with the specified number
ru_ru: Со статьи с указанным номером

source: Specified Number Of Articles
ru_ru: Указанное количество статей

source: Template Name
ru_ru: Имя шаблона

source: Filtering
ru_ru: Фильтрация

source: Source
ru_ru: Источник

source: Order
ru_ru: Порядок

source: Paging
ru_ru: Постраничный вывод

source: Caching
ru_ru: Кэширование

source: Form Parameters
ru_ru: Параметры формы

source: Add Default Value
ru_ru: Добавить значение по умолчанию

source: Ascending
ru_ru: По возрастанию

source: Descending
ru_ru: По убыванию

source: Controls Inheritance
ru_ru: Наследование контролов

source: Data Binding
ru_ru: Связывание с данными

source: Format
ru_ru: Формат

source: Pages Inheritance
ru_ru: Наследование страниц

source: Regional and Language Settings
ru_ru: Региональные и языковые настройки

source: ViewState Parameters
ru_ru: Параметры ViewState

source: Browser Caching
ru_ru: Кэширование в браузере

# NetNameNotUnique
source: .NET Class Name is already in using!
ru_ru: Имя .NET-класса шаблона должно быть уникальным

# FileNameInvalidFormat
source: File name has invalid format
ru_ru: Имя файла имеет неверный формат

# ContentRequired
source: Content is required
ru_ru: Необходимо указать контент

# DynamicContentVariableMaxLengthExceeded
source: Dynamic content variable length should not exceed 255 characters
ru_ru: Длина переменной, содержащей название контента не должна превышать {0} символов

# DynamicContentVariableRequired
source: Please enter Dynamic Content Variable
ru_ru: Пожалуйста укажите Переменную, содержащую название контента

# FilterMaxLengthExceeded
source: Filter length should not exceed {0} characters
ru_ru: Длина фильтра не доджна превышать 512 символов

# DynamicSortingExpressionMaxLengthExceeded
source: Dynamic Sorting Expression length should not exceed 255 characters
ru_ru: Длина Выражения динамической сортировки не должна превышать {0} символов

# DynamicSortingExpressionRequired
source: Please enter Dynamic Sorting Expression
ru_ru: Пожалуйста, введите Выражение динамической сортировки

# OrderDynamicMaxLengthExceeded
source: Order Dynamic length should not exceed 255 characters
ru_ru: Длина Выражения динамической сортировки не должна превышать 255 символов

# OrderDynamicRequired
source: Please, enter Order Dynamic
ru_ru: Пожалуйста, введите Выражение динамической сортировки

# SelectStartRequired
source: Please, enter Selection is starting
ru_ru: Пожалуйста, укажите номер первой статьи в выборке

# SelectTotalMaxLengthExceeded
source: Select total length should not exceed 255 characters
ru_ru: Длина количества статей в выборке не должна превышать 255 символов

# SelectTotalRequired
source: Please, enter Select total
ru_ru: Пожалуйста, укажите количество статей в выборке

# SortExperessionFieldNotUnique
source: Sort Experession #{0} field should be unique within this object!
ru_ru: Поле сортировки по умолчанию №{0} должно быть уникальным в пределах текущего объекта!

# StatusTypeRequired
source: At least one status is required
ru_ru: Необходимо выбрать хотя бы один статус

# ParentObjectIdRequired
source: PLease, select Parent Object Id
ru_ru: Необходимо выбрать Родительский объект шаблона

# AssembleLiveSiteTemplateConfirmation
source: Are you sure that you want to assemble this template despite the fact that it belongs to live site?
ru_ru: Вы действительно хотите собрать этот шаблон, несмотря на то, что он принадлежит live сайту?

# AssembleTemplateStageName
source: Assembling template {0}
ru_ru: Сборка шаблона {0}

# ObjectPromoted
source: Object {0} has been promoted
ru_ru: Объект {0} успешно повышен

# UnableToPromote
source: Promoting inherited objects is not allowed
ru_ru: Запрещено повышать переопределенные объекты

# UnableToDeleteFormat
source: Deleting this format is not allowed because it is being used by some notification
ru_ru: Удаление этого формата невозможно, т.к. он используется уведомлением

# UnableToDeleteObject
source: Deleting this object is not allowed because its format is being used by some notification
ru_ru: Удаление этого объекта невозможно, т.к. его формат используется уведомлением

source: Select Template
ru_ru: Выберите шаблон

source: FilterString
ru_ru: Значения для поиска

source: Search
ru_ru: Поиск

# VersionRestored
source: Version #{0} has been successfully restored
ru_ru: Версия №{0} была успешно восстановлена

# VersionRestoreError
source: Version # {0} wasn`t restored
ru_ru: Во время восстановки версии № {0} произошла ошибка

# FormatVersionNotFound
source: Format version #{0} not found
ru_ru: Версия формата №{0} не найдена

# FormatVersionNotFoundForFormat
source: Format version (Id = {0}) not found for format (Id = {1})
ru_ru: Версия формата (Id = {0}) не найдена для формата (Id = {1})

source: Filtration Parameters
ru_ru: Параметры фильтрации

source: Select Page
ru_ru: Выберите страницу

source: Insert Call
ru_ru: Вставить вызов

source: Function
ru_ru: Функция

# ContainerProp
source: Container Property
ru_ru: Свойство контейнера

source: Select Function
ru_ru: Выберите функцию

source: Select Property
ru_ru: Выберите свойство

source: Page Object
ru_ru: Объект страницы

source: Template Object
ru_ru: Объект шаблона

source: Select Field
ru_ru: Выберите поле

source: Rest Template Object
ru_ru: Объект других шаблонов

# ReplaceConfirmation
source: Do you really want to restore the default value?
ru_ru: Вы действительно хотите восстановить значение по-умолчанию?

source: Library
ru_ru: Библиотека

source: SetDefault
ru_ru: Установить значение по-умолчанию

# PageNotCreated
source: New page has not been created.
ru_ru: Новая страница не была создана

# CopySiteTemplates
source: Copying templates from site {0}
ru_ru: Копирование шаблонов сайта {0}
